; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v4)
		(pred_6 ?v3)
		(pred_3 ?v5)
		(pred_2 ?v5)
		(pred_5 ?v3 ?v5)
		(pred_1)
		(pred_4 ?v3))

   (:action op_3
       :parameters  (?v1 ?v6)
       :precondition (and (not-eq ?v1 ?v6) 
                          (pred_3 ?v1) (pred_3 ?v6) (pred_2 ?v1))
       :effect (and  (pred_2 ?v6)
		     (not (pred_2 ?v1))))


   (:action op_2
       :parameters (?v8 ?v2)
       :precondition  (and  (pred_6 ?v8) (pred_3 ?v2)
			    (pred_5 ?v8 ?v2) (pred_2 ?v2) (pred_1))
       :effect (and (pred_4 ?v8)
		    (not (pred_5 ?v8 ?v2)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v8  ?v2)
       :precondition  (and  (pred_6 ?v8) (pred_3 ?v2)
			    (pred_4 ?v8) (pred_2 ?v2))
       :effect (and (pred_5 ?v8 ?v2)
		    (pred_1)
		    (not (pred_4 ?v8)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_03 obj_01 obj_04 
          obj_02 obj_06 obj_05 
)
(:init
(pred_3 obj_03)
(pred_3 obj_01)
(pred_3 obj_04)
(pred_6 obj_02)
(pred_6 obj_06)
(pred_6 obj_05)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_1)
(pred_5 obj_02 obj_03)
(pred_5 obj_06 obj_04)
(pred_5 obj_05 obj_03)
(pred_2 obj_04)
)
(:goal
(and
(pred_5 obj_02 obj_03)
(pred_5 obj_06 obj_01)
(pred_5 obj_05 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_06 obj_01) (pred_2 obj_03))
    (sometime-before  (pred_5 obj_05 obj_04) (pred_2 obj_01))
  )
)
)

; plan
1. (op_2 obj_06 obj_04)
   deleted: (pred_5 obj_06 obj_04) (pred_1)
   added: (pred_4 obj_06)
   goals met: 1 of 3
2. (op_3 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 1 of 3
3. (op_3 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_03)
   goals met: 1 of 3
4. (op_1 obj_06 obj_03)
   deleted: (pred_4 obj_06)
   added: (pred_5 obj_06 obj_03) (pred_1)
   goals met: 1 of 3
5. (op_2 obj_05 obj_03)
   deleted: (pred_5 obj_05 obj_03) (pred_1)
   added: (pred_4 obj_05)
   goals met: 1 of 3
6. (op_3 obj_03 obj_04)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_04)
   goals met: 1 of 3
7. (op_1 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_5 obj_05 obj_04) (pred_1)
   goals met: 2 of 3
8. (op_3 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 2 of 3
9. (op_3 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_03)
   goals met: 2 of 3
10. (op_2 obj_06 obj_03)
   deleted: (pred_5 obj_06 obj_03) (pred_1)
   added: (pred_4 obj_06)
   goals met: 2 of 3
11. (op_3 obj_03 obj_01)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_01)
   goals met: 2 of 3
12. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_06)
   added: (pred_5 obj_06 obj_01) (pred_1)
   goals met: 3 of 3
